<template>
  <div class="main">
    <div>
      <div class="count">
        {{ counts(playList.playCount ) }}</div>
      <img :src="playList.coverImgUrl"
           alt="" />
    </div>
    <div class="main_right">
      <h1>{{ playList.name }}</h1>
      <svg t="1656689580064"
           class="icon"
           viewBox="0 0 1024 1024"
           version="1.1"
           xmlns="http://www.w3.org/2000/svg"
           p-id="2263"
           width="200"
           height="200">
        <path d="M890.175 510.476c-3.608 209.441-169.818 375.647-379.258 379.254-209.452 3.608-375.736-175.244-379.25-379.254-3.607-209.452 175.24-375.74 379.25-379.254 209.456-3.608 375.744 175.24 379.258 379.254 0.683 39.616 62.184 39.681 61.5 0C947.747 282.367 779.11 99.223 553.72 71.928 327.607 44.547 119.133 213.131 77.33 431.658 34.671 654.637 177.98 870.915 391.534 934.87c218.948 65.57 446.011-61.138 530.682-266.08 20.6-49.863 28.536-104.69 29.459-158.315 0.683-39.68-60.818-39.614-61.5 0.001z"
              p-id="2264"
              fill="#ffffff"></path>
        <path d="M506.967 675.328L650.08 532.22c11.847-11.847 11.847-31.641 0-43.488l-143.112-143.11c-28.067-28.067-71.554 15.42-43.487 43.487L606.59 532.22v-43.487L463.48 631.84c-28.067 28.068 15.42 71.555 43.487 43.488z"
              p-id="2265"
              fill="#ffffff"></path>
      </svg>
      <div class="main_content">
        <img :src="playList.creator.avatarUrl" />
        <span>{{ playList.creator.nickname }}</span>
        <div class="box">
          <van-icon name="plus"
                    size=".4rem" />
        </div>
      </div>
      <div class="main_bottom">
        <span class="describe">{{ description(playList.description) }}</span>
        <van-icon name="arrow"
                  size=".4rem" />
      </div>
    </div>
  </div>
  <div class="icons">
    <div class="box"></div>
    <div>
      <svg t="1657172963332"
           class="icon"
           viewBox="0 0 1024 1024"
           version="1.1"
           xmlns="http://www.w3.org/2000/svg"
           p-id="5107"
           width="200"
           height="200">
        <path d="M788.281302 548.493644h-540.994717c-16.799836 0-30.399703-13.599867-30.399703-30.399704 0-16.799836 13.599867-30.399703 30.399703-30.399703h540.994717c16.799836 0 30.399703 13.599867 30.399703 30.399703 0 16.699837-13.599867 30.399703-30.399703 30.399704zM517.683944 819.191c-16.799836 0-30.399703-13.599867-30.399703-30.399703v-541.494712c0-16.799836 13.599867-30.399703 30.399703-30.399703s30.399703 13.599867 30.399704 30.399703v541.494712c0.099999 16.799836-13.599867 30.399703-30.399704 30.399703zM512.483995 1023.989c-69.099325 0-136.19867-13.499868-199.298053-40.299606-60.999404-25.799748-115.798869-62.699388-162.698412-109.798928-47.09954-46.999541-83.99918-101.699007-109.798927-162.79841-26.699739-63.199383-40.199607-130.198729-40.199608-199.298054s13.599867-136.19867 40.199608-199.298054c25.799748-60.699407 62.699388-115.598871 109.798927-162.598412s101.699007-83.99918 162.698412-109.59893c63.099384-26.699739 130.198729-40.299606 199.298053-40.299606s136.19867 13.499868 199.298054 40.299606c60.999404 25.799748 115.798869 62.599389 162.698411 109.59893 47.09954 46.999541 83.99918 101.699007 109.798928 162.79841 26.699739 63.199383 40.199607 130.198729 40.199607 199.298054 0 92.699095-25.099755 183.498208-72.499292 262.697435-8.699915 14.499858-27.299733 19.099813-41.699592 10.499897-14.399859-8.699915-18.999814-27.299733-10.499898-41.799592 41.699593-69.699319 63.799377-149.698538 63.899376-231.297741 0-60.899405-11.899884-119.898829-35.399654-175.498286-22.699778-53.799475-55.29946-101.899005-96.699056-143.3986s-89.799123-73.999277-143.498599-96.699055c-55.599457-23.59977-114.69888-35.399654-175.698284-35.399655s-119.998828 11.899884-175.698284 35.399655c-53.599477 22.699778-101.799006 55.199461-143.198602 96.699055s-73.999277 89.599125-96.699055 143.3986c-23.499771 55.599457-35.399654 114.69888-35.399654 175.498286 0 60.899405 11.899884 119.898829 35.399654 175.498286 22.699778 53.799475 55.29946 101.899005 96.699055 143.3986 41.399596 41.399596 89.799123 73.999277 143.498599 96.699056 55.599457 23.59977 114.69888 35.399654 175.698284 35.399654 90.899112 0 178.498257-26.899737 253.397526-77.79924 13.899864-9.399908 32.79968-5.899942 42.299587 7.999921 9.399908 13.899864 5.899942 32.899679-7.999922 42.299587-85.199168 57.899435-184.698196 88.399137-287.897189 88.399137z"
              p-id="5108"></path>
      </svg>
      <!-- 收藏次数 -->
      <span>{{ playList.subscribedCount }}</span>
      <i></i>
    </div>
    <div>
      <svg t="1657075750933"
           class="icon"
           viewBox="0 0 1024 1024"
           version="1.1"
           xmlns="http://www.w3.org/2000/svg"
           p-id="11982"
           width="200"
           height="200">
        <path d="M512 799.44c-24.12586667 0-48.2816-2.19413333-71.33546667-6.58453333l-167.84 102.048v-168.96c-87.7888-61.45386667-143.712-155.792-143.712-261.12106667 0-185.41226667 171.1232-335.72693333 382.8864-335.72693333 211.73013333 0 382.88533333 150.31466667 382.88533334 335.72693333S723.72906667 799.44 512 799.44z m0-622.0608c-185.42826667 0-335.7408 128.36693333-335.7408 287.44426667 0 97.6384 57.06133333 183.21493333 142.64 234.78186666V811.52l113.01973333-68.02133333c26.30186667 5.48053333 52.64213333 8.7616 81.18506667 8.7616 185.39946667 0 335.712-128.36693333 335.712-287.43786667C847.7056 305.74506667 697.39413333 177.3792 512 177.3792z m167.8368 263.30026667H344.12906667c-13.16693333 0-24.12693333-10.976-24.12693334-24.12693334 0-13.16693333 10.95893333-24.13866667 24.128-24.13866666h335.70666667c13.20213333 0 24.16106667 10.9728 24.16106667 24.13866666-0.00106667 13.152-10.96 24.128-24.16 24.128z m-287.42613333 95.44533333h239.17546666c13.168 0 24.12586667 10.98986667 24.12586667 24.14186667 0 13.16906667-10.9568 24.1408-24.12586667 24.1408H392.41066667c-13.1648 0-24.1248-10.97173333-24.1248-24.1408 0-13.152 10.96106667-24.14293333 24.1248-24.14293334z m0 0"
              p-id="11983"
              fill="#000"></path>
      </svg>
      <!-- 评论次数 -->
      <span>{{ playList.commentCount }}</span>
      <i></i>
    </div>
    <div>
      <svg t="1657075302825"
           class="icon"
           viewBox="0 0 1024 1024"
           version="1.1"
           xmlns="http://www.w3.org/2000/svg"
           p-id="4553"
           width="200"
           height="200">
        <path d="M763.84 896c-47.128 0-85.333-38.205-85.333-85.333s38.205-85.333 85.333-85.333c47.128 0 85.333 38.205 85.333 85.333 0 47.128-38.205 85.333-85.333 85.333M329.92 558.848c-14.895 26.231-42.641 43.638-74.453 43.638-47.128 0-85.333-38.205-85.333-85.333 0-16.097 4.457-31.152 12.204-44 14.935-24.769 42.098-41.333 73.13-41.333 47.128 0 85.333 38.205 85.333 85.333 0 15.317-4.035 29.691-11.101 42.117M763.84 128c47.128 0 85.333 38.205 85.333 85.333s-38.205 85.333-85.333 85.333c-47.128 0-85.333-38.205-85.333-85.333 0-47.128 38.205-85.333 85.333-85.333M763.84 682.667c-0.021 0-0.047 0-0.072 0-39.16 0-74.203 17.626-97.628 45.378l-289.885-167.063c4.932-13.101 7.787-28.245 7.787-44.055 0-0.105 0-0.209 0-0.314 0-0.072 0-0.177 0-0.281 0-15.81-2.855-30.953-8.077-44.942l295.544-169.566c23.265 24.363 56.001 39.509 92.275 39.509 0.020 0 0.039 0 0.059 0 70.689 0 127.997-57.308 127.997-128 0-70.692-57.308-128-128-128-70.692 0-128 57.308-128 128 0 18.965 4.224 36.907 11.627 53.099l-292.288 168.747c-23.653-28.833-59.285-47.084-99.18-47.084-70.692 0-128 57.308-128 128 0 0.188 0 0.376 0.001 0.564-0.001 0.123-0.001 0.304-0.001 0.484 0 70.692 57.308 128 128 128 39.895 0 75.526-18.251 99.001-46.86l289.373 166.752c-5.397 13.568-8.529 29.29-8.533 45.743 0 70.582 57.308 127.889 128 127.889 70.692 0 128-57.308 128-128 0-70.692-57.308-128-128-128z"
              fill="#000"
              p-id="4554"></path>
      </svg>
      <!-- 分享次数 -->
      <span>{{ playList.shareCount }}</span>
    </div>
  </div>
</template>

<script>
import { counts } from '@/hooks/counts';
import { ref } from "vue";
export default {
  name: "ItemMusciCenter",
  props: ["playList"],
  setup (props) {
    const show = ref(false);
    const showPopup = () => {
      show.value = true;
    };
    // const counts = (ele) => {
    //   counts(ele)
    // }
    // 获取本地存储数据
    if ((props.playList.creator = "")) {
      props.playList.creator = JSON.parse(
        sessionStorage.getItem("itemdata")
      ).creator;
    }
    function description (data) {
      console.log();
      if (!data) {
        return '介绍无'
      } else {
        return data
      }
    }
    return {
      show,
      counts,
      showPopup,
      description
    };
  },
};
</script>

<style lang="less" scoped>
.main {
  display: flex;
  align-items: center;
  position: relative;
  height: 3.2rem;
  border-radius: 0.4rem;
  margin-left: 0.4rem;
  .count {
    position: absolute;
    top: 0.1rem;
    left: 2rem;
    width: 1.3rem;
    height: 0.4rem;
    text-align: center;
    line-height: 0.4rem;
    border-radius: 0.4rem;
    border: 1px solid #eee;
    color: #fff;
    opacity: 0.7;
    font-size: 0.24rem;
    font-weight: 100;
  }
  .main_right {
    height: 100%;
    margin-left: 0.3rem;
    .van-icon {
      float: right;
      color: rgb(233, 233, 233);
    }
    .main_content {
      display: flex;
      align-items: center;
      margin-bottom: 0.3rem;
    }
    .main_bottom {
      display: flex;
      width: 100%;
      height: 0.5rem;
      align-items: center;
    }
    .box {
      position: relative;
      display: inline-block;
      vertical-align: middle;
      width: 0.9rem;
      height: 0.6rem;
      margin-left: 0.1rem;
      line-height: 0.6rem;
      border-radius: 0.6rem;
      background-color: rgb(187, 187, 187);
      .van-icon {
        position: absolute;
        top: 50%;
        left: 50%;
        transform: translate(-50%, -50%);
        color: rgb(233, 233, 233);
      }
    }
    img {
      vertical-align: middle;
      width: 0.8rem;
      height: 0.8rem;
      border-radius: 50%;
    }
    svg {
      margin-left: 0.36rem;
      margin-bottom: 0.8rem;
      transform: rotate(90deg);
    }
    h1 {
      float: left;
      width: 75%;
      height: 1.2rem;
      color: #fff;
      font-size: 0.46rem;
      overflow: hidden;
      text-overflow: ellipsis;
      /* 弹性伸缩盒子模型显示 */
      display: -webkit-box;
      /* 限制在一个块元素显示的文本的行数 */
      -webkit-line-clamp: 2;
      /* 设置或检索伸缩盒对象的子元素的排列方式 */
      -webkit-box-orient: vertical;
    }
    .describe {
      vertical-align: middle;
      width: 4rem;
      font-size: 0.35rem;
      margin: 0;
      color: rgb(241, 240, 240);
      letter-spacing: 0.05rem;
      overflow: hidden;
      text-overflow: ellipsis;
      /* 弹性伸缩盒子模型显示 */
      display: -webkit-box;
      /* 限制在一个块元素显示的文本的行数 */
      -webkit-line-clamp: 1;
      /* 设置或检索伸缩盒对象的子元素的排列方式 */
      -webkit-box-orient: vertical;
    }
    span {
      margin-left: 0.2rem;
      font-size: 0.28rem;
      color: rgb(236, 236, 236);
    }
  }
  img {
    width: 3.4rem;
    height: 3.4rem;
    border-radius: 0.4rem;
  }
}
.icons {
  position: relative;
  display: flex;
  justify-content: space-between;
  align-items: center;
  width: 80%;
  margin: 0.4rem auto;
  height: 1.2rem;
  box-shadow: rgba(0, 0, 0, 0.1) 0px 2px 8px;
  line-height: 1rem;
  border-radius: 0.6rem;
  padding: 0 0.4rem;
  background-color: #fff;
  div {
    display: flex;
    align-items: center;
    svg {
      width: 0.65rem;
      height: 0.6rem;
    }
    span {
      margin-left: 0.1rem;
      font-size: 0.36rem;
    }
    i {
      display: inline-block;
      margin-left: 0.55rem;
      width: 0.02rem;
      height: 0.5rem;
      background-color: rgb(223, 222, 222);
    }
  }
}
</style>